--客户基金产品分类汇总
drop table #temp_khjjflhz;
create table #temp_khjjflhz
(
	nian 						varchar(4)		not null
	,yue						varchar(2)		not null
	,zjzh 						varchar(128)	not null	
	,产品类型					varchar(128)	not null
	,责权关系类型				varchar(128)
	
	--未扣减数据
	,销售金额_月累计_原始			numeric(20,4)
	,销售金额_月累计_考核			numeric(20,4)
	,赎回金额_月累计_原始			numeric(20,4)
	,赎回金额_月累计_考核			numeric(20,4)
	,销售金额_年累计_原始			numeric(20,4)
	,销售金额_年累计_考核			numeric(20,4)
	,赎回金额_年累计_原始			numeric(20,4)
	,赎回金额_年累计_考核			numeric(20,4)
	,期初市值_原始				numeric(20,4)	--去年末市值
	,期初市值_考核				numeric(20,4)	--去年末市值
	,期末市值_原始				numeric(20,4)
	,期末市值_考核				numeric(20,4)
	,月日均市值_原始				numeric(20,4)
	,月日均市值_考核				numeric(20,4)
	,年日均市值_原始				numeric(20,4)
	,年日均市值_考核				numeric(20,4)
	,认申购手续费_月累计			numeric(20,4)
	,认申购手续费_年累计			numeric(20,4)		
	
	--资管总部销售待扣减项
	,销售金额_月累计_总部_原始	numeric(20,4)
	,销售金额_月累计_总部_考核	numeric(20,4)
	,赎回金额_月累计_总部_原始	numeric(20,4)
	,赎回金额_月累计_总部_考核	numeric(20,4)
	,销售金额_年累计_总部_原始	numeric(20,4)
	,销售金额_年累计_总部_考核	numeric(20,4)
	,赎回金额_年累计_总部_原始	numeric(20,4)
	,赎回金额_年累计_总部_考核	numeric(20,4)
	,期初市值_总部_原始			numeric(20,4)	--去年末市值
	,期初市值_总部_考核			numeric(20,4)	--去年末市值
	,期末市值_总部_原始			numeric(20,4)
	,期末市值_总部_考核			numeric(20,4)
	,月日均市值_总部_原始			numeric(20,4)
	,月日均市值_总部_考核			numeric(20,4)
	,年日均市值_总部_原始			numeric(20,4)
	,年日均市值_总部_考核			numeric(20,4)		
	
	--扣除总部销售后
	,销售金额_月累计_扣减后_原始	numeric(20,4)
	,销售金额_月累计_扣减后_考核	numeric(20,4)
	,赎回金额_月累计_扣减后_原始	numeric(20,4)
	,赎回金额_月累计_扣减后_考核	numeric(20,4)
	,销售金额_年累计_扣减后_原始	numeric(20,4)
	,销售金额_年累计_扣减后_考核	numeric(20,4)
	,赎回金额_年累计_扣减后_原始	numeric(20,4)
	,赎回金额_年累计_扣减后_考核	numeric(20,4)
	,期初市值_扣减后_原始			numeric(20,4)	--去年末市值
	,期初市值_扣减后_考核			numeric(20,4)	--去年末市值
	,期末市值_扣减后_原始			numeric(20,4)
	,期末市值_扣减后_考核			numeric(20,4)
	,月日均市值_扣减后_原始		numeric(20,4)
	,月日均市值_扣减后_考核		numeric(20,4)
	,年日均市值_扣减后_原始		numeric(20,4)
	,年日均市值_扣减后_考核		numeric(20,4)	
	
	--首发数据
	,销售金额_月累计_首发_原始 	numeric(20,4)
	,销售金额_月累计_首发_考核 	numeric(20,4)
	,销售金额_年累计_首发_原始 	numeric(20,4)
	,销售金额_年累计_首发_考核 	numeric(20,4)
	,认申购手续费_月累计_首发		numeric(20,4)
	,认申购手续费_年累计_首发		numeric(20,4)	
	
	--换购数据
	,换购金额_月累计				numeric(20,4)
	,换购金额_年累计				numeric(20,4)	
	,constraint pk_skb_temp_khjjflhz primary key (nian,yue,zjzh,产品类型)	
);

insert into #temp_khjjflhz
(
	nian
	,yue
	,zjzh	
	,产品类型
	,责权关系类型
	--未扣减数据
	,销售金额_月累计_原始	
	,销售金额_月累计_考核	
	,赎回金额_月累计_原始	
	,赎回金额_月累计_考核	
	,销售金额_年累计_原始	
	,销售金额_年累计_考核	
	,赎回金额_年累计_原始	
	,赎回金额_年累计_考核	
	,期初市值_原始
	,期初市值_考核
	,期末市值_原始
	,期末市值_考核
	,月日均市值_原始
	,月日均市值_考核
	,年日均市值_原始
	,年日均市值_考核
	,认申购手续费_月累计
	,认申购手续费_年累计		
	--资管总部销售待扣减项
	,销售金额_月累计_总部_原始
	,销售金额_月累计_总部_考核
	,赎回金额_月累计_总部_原始
	,赎回金额_月累计_总部_考核
	,销售金额_年累计_总部_原始
	,销售金额_年累计_总部_考核
	,赎回金额_年累计_总部_原始
	,赎回金额_年累计_总部_考核
	,期初市值_总部_原始
	,期初市值_总部_考核
	,期末市值_总部_原始
	,期末市值_总部_考核
	,月日均市值_总部_原始
	,月日均市值_总部_考核	
	,年日均市值_总部_原始	
	,年日均市值_总部_考核			
	--扣除总部销售后
	,销售金额_月累计_扣减后_原始
	,销售金额_月累计_扣减后_考核
	,赎回金额_月累计_扣减后_原始
	,赎回金额_月累计_扣减后_考核
	,销售金额_年累计_扣减后_原始
	,销售金额_年累计_扣减后_考核
	,赎回金额_年累计_扣减后_原始
	,赎回金额_年累计_扣减后_考核
	,期初市值_扣减后_原始	
	,期初市值_扣减后_考核	
	,期末市值_扣减后_原始	
	,期末市值_扣减后_考核	
	,月日均市值_扣减后_原始
	,月日均市值_扣减后_考核
	,年日均市值_扣减后_原始
	,年日均市值_扣减后_考核	
	--首发数据
	,销售金额_月累计_首发_原始
	,销售金额_月累计_首发_考核
	,销售金额_年累计_首发_原始
	,销售金额_年累计_首发_考核
	,认申购手续费_月累计_首发
	,认申购手续费_年累计_首发	
	--换购数据
	,换购金额_月累计
	,换购金额_年累计	
)
(
	select
		t1.nian
		,t1.yue
		,t1.zjzh	
		,t1.产品类型
		,t1.责权关系类型
		,sum(t1.销售金额_月累计_原始) as 销售金额_月累计_原始
		,sum(t1.销售金额_月累计_考核) as 销售金额_月累计_考核
		,sum(t1.赎回金额_月累计_原始) as 赎回金额_月累计_原始
		,sum(t1.赎回金额_月累计_考核) as 赎回金额_月累计_考核
		,sum(t1.销售金额_年累计_原始) as 销售金额_年累计_原始
		,sum(t1.销售金额_年累计_考核) as 销售金额_年累计_考核
		,sum(t1.赎回金额_年累计_原始) as 赎回金额_年累计_原始
		,sum(t1.赎回金额_年累计_考核) as 赎回金额_年累计_考核
		,sum(t1.期初市值_原始) as 期初市值_原始
		,sum(t1.期初市值_考核) as 期初市值_考核
		,sum(t1.期末市值_原始) as 期末市值_原始
		,sum(t1.期末市值_考核) as 期末市值_考核
		,sum(t1.月日均市值_原始) as 月日均市值_原始
		,sum(t1.月日均市值_考核) as 月日均市值_考核
		,sum(t1.年日均市值_原始) as 年日均市值_原始
		,sum(t1.年日均市值_考核) as 年日均市值_考核
		,sum(t1.认申购手续费_月累计) as 认申购手续费_月累计
		,sum(t1.认申购手续费_年累计) as 认申购手续费_年累计
		,sum(t1.销售金额_月累计_总部_原始) as 销售金额_月累计_总部_原始
		,sum(t1.销售金额_月累计_总部_考核) as 销售金额_月累计_总部_考核
		,sum(t1.赎回金额_月累计_总部_原始) as 赎回金额_月累计_总部_原始
		,sum(t1.赎回金额_月累计_总部_考核) as 赎回金额_月累计_总部_考核
		,sum(t1.销售金额_年累计_总部_原始) as 销售金额_年累计_总部_原始
		,sum(t1.销售金额_年累计_总部_考核) as 销售金额_年累计_总部_考核
		,sum(t1.赎回金额_年累计_总部_原始) as 赎回金额_年累计_总部_原始
		,sum(t1.赎回金额_年累计_总部_考核) as 赎回金额_年累计_总部_考核
		,sum(t1.期初市值_总部_原始) as 期初市值_总部_原始
		,sum(t1.期初市值_总部_考核) as 期初市值_总部_考核
		,sum(t1.期末市值_总部_原始) as 期末市值_总部_原始
		,sum(t1.期末市值_总部_考核) as 期末市值_总部_考核
		,sum(t1.月日均市值_总部_原始) as 月日均市值_总部_原始
		,sum(t1.月日均市值_总部_考核) as 月日均市值_总部_考核
		,sum(t1.年日均市值_总部_原始) as 年日均市值_总部_原始
		,sum(t1.年日均市值_总部_考核) as 年日均市值_总部_考核
		,sum(t1.销售金额_月累计_扣减后_原始) as 销售金额_月累计_扣减后_原始
		,sum(t1.销售金额_月累计_扣减后_考核) as 销售金额_月累计_扣减后_考核
		,sum(t1.赎回金额_月累计_扣减后_原始) as 赎回金额_月累计_扣减后_原始
		,sum(t1.赎回金额_月累计_扣减后_考核) as 赎回金额_月累计_扣减后_考核
		,sum(t1.销售金额_年累计_扣减后_原始) as 销售金额_年累计_扣减后_原始
		,sum(t1.销售金额_年累计_扣减后_考核) as 销售金额_年累计_扣减后_考核
		,sum(t1.赎回金额_年累计_扣减后_原始) as 赎回金额_年累计_扣减后_原始
		,sum(t1.赎回金额_年累计_扣减后_考核) as 赎回金额_年累计_扣减后_考核
		,sum(t1.期初市值_扣减后_原始) as 期初市值_扣减后_原始
		,sum(t1.期初市值_扣减后_考核) as 期初市值_扣减后_考核
		,sum(t1.期末市值_扣减后_原始) as 期末市值_扣减后_原始
		,sum(t1.期末市值_扣减后_考核) as 期末市值_扣减后_考核
		,sum(t1.月日均市值_扣减后_原始) as 月日均市值_扣减后_原始
		,sum(t1.月日均市值_扣减后_考核) as 月日均市值_扣减后_考核
		,sum(t1.年日均市值_扣减后_原始) as 年日均市值_扣减后_原始
		,sum(t1.年日均市值_扣减后_考核) as 年日均市值_扣减后_考核
		,sum(t1.销售金额_月累计_首发_原始) as 销售金额_月累计_首发_原始
		,sum(t1.销售金额_月累计_首发_考核) as 销售金额_月累计_首发_考核
		,sum(t1.销售金额_年累计_首发_原始) as 销售金额_年累计_首发_原始
		,sum(t1.销售金额_年累计_首发_考核) as 销售金额_年累计_首发_考核
		,sum(t1.认申购手续费_月累计_首发) as 认申购手续费_月累计_首发
		,sum(t1.认申购手续费_年累计_首发) as 认申购手续费_年累计_首发
		,sum(t1.换购金额_月累计) as 换购金额_月累计
		,sum(t1.换购金额_年累计) as 换购金额_年累计
	from #temp_khjjflmx t1
	group by t1.nian,t1.yue,t1.zjzh,t1.产品类型,t1.责权关系类型	
)