--客户属性产品
drop table #temp_khcp_ys;
create table #temp_khcp_ys
(
	nian 										varchar(4)		not null
	,yue										varchar(2)		not null
	,zjzh 										varchar(128)	not null		
	--销售金额_月累计	
	,核心公募股票型_销售金额_月累计				numeric(20,4)
	,非核心公募股票型_销售金额_月累计				numeric(20,4)
	,公募债券型有手续费_销售金额_月累计			numeric(20,4)
	,公募债券型无手续费_销售金额_月累计			numeric(20,4)
	,公募货币型_销售金额_月累计					numeric(20,4)
	,集合理财股票型_销售金额_月累计				numeric(20,4)
	,集合理财债券型_销售金额_月累计				numeric(20,4)
	,集合理财货币型_销售金额_月累计				numeric(20,4)
	,基金专户股票型_销售金额_月累计				numeric(20,4)
	,基金专户债券型_销售金额_月累计				numeric(20,4)
	,基金专户货币型_销售金额_月累计				numeric(20,4)	
	,公募_销售金额_月累计							numeric(20,4)
	,核心公募_销售金额_月累计						numeric(20,4)
	,集合理财_销售金额_月累计						numeric(20,4)
	,基金专户_销售金额_月累计						numeric(20,4)	
	--销售金额_月累计_首发
	,核心公募股票型_销售金额_月累计_首发			numeric(20,4)
	,非核心公募股票型_销售金额_月累计_首发			numeric(20,4)
	,公募债券型有手续费_销售金额_月累计_首发		numeric(20,4)
	,公募债券型无手续费_销售金额_月累计_首发		numeric(20,4)
	,公募货币型_销售金额_月累计_首发				numeric(20,4)
	,集合理财股票型_销售金额_月累计_首发			numeric(20,4)
	,集合理财债券型_销售金额_月累计_首发			numeric(20,4)
	,集合理财货币型_销售金额_月累计_首发			numeric(20,4)
	,基金专户股票型_销售金额_月累计_首发			numeric(20,4)
	,基金专户债券型_销售金额_月累计_首发			numeric(20,4)
	,基金专户货币型_销售金额_月累计_首发			numeric(20,4)	
	,公募_销售金额_月累计_首发					numeric(20,4)
	,核心公募_销售金额_月累计_首发				numeric(20,4)
	,集合理财_销售金额_月累计_首发				numeric(20,4)
	,基金专户_销售金额_月累计_首发				numeric(20,4)
	--赎回金额_月累计	
	,核心公募股票型_赎回金额_月累计				numeric(20,4)
	,非核心公募股票型_赎回金额_月累计				numeric(20,4)
	,公募债券型有手续费_赎回金额_月累计			numeric(20,4)
	,公募债券型无手续费_赎回金额_月累计			numeric(20,4)
	,公募货币型_赎回金额_月累计					numeric(20,4)
	,集合理财股票型_赎回金额_月累计				numeric(20,4)
	,集合理财债券型_赎回金额_月累计				numeric(20,4)
	,集合理财货币型_赎回金额_月累计				numeric(20,4)
	,基金专户股票型_赎回金额_月累计				numeric(20,4)
	,基金专户债券型_赎回金额_月累计				numeric(20,4)
	,基金专户货币型_赎回金额_月累计				numeric(20,4)	
	,公募_赎回金额_月累计							numeric(20,4)
	,核心公募_赎回金额_月累计						numeric(20,4)
	,集合理财_赎回金额_月累计						numeric(20,4)
	,基金专户_赎回金额_月累计						numeric(20,4)
	--销售金额_年累计	
	,核心公募股票型_销售金额_年累计				numeric(20,4)
	,非核心公募股票型_销售金额_年累计				numeric(20,4)
	,公募债券型有手续费_销售金额_年累计			numeric(20,4)
	,公募债券型无手续费_销售金额_年累计			numeric(20,4)
	,公募货币型_销售金额_年累计					numeric(20,4)
	,集合理财股票型_销售金额_年累计				numeric(20,4)
	,集合理财债券型_销售金额_年累计				numeric(20,4)
	,集合理财货币型_销售金额_年累计				numeric(20,4)
	,基金专户股票型_销售金额_年累计				numeric(20,4)
	,基金专户债券型_销售金额_年累计				numeric(20,4)
	,基金专户货币型_销售金额_年累计				numeric(20,4)	
	,公募_销售金额_年累计							numeric(20,4)
	,核心公募_销售金额_年累计						numeric(20,4)
	,集合理财_销售金额_年累计						numeric(20,4)
	,基金专户_销售金额_年累计						numeric(20,4)
	--销售金额_年累计_首发
	,核心公募股票型_销售金额_年累计_首发			numeric(20,4)
	,非核心公募股票型_销售金额_年累计_首发			numeric(20,4)
	,公募债券型有手续费_销售金额_年累计_首发		numeric(20,4)
	,公募债券型无手续费_销售金额_年累计_首发		numeric(20,4)
	,公募货币型_销售金额_年累计_首发				numeric(20,4)
	,集合理财股票型_销售金额_年累计_首发			numeric(20,4)
	,集合理财债券型_销售金额_年累计_首发			numeric(20,4)
	,集合理财货币型_销售金额_年累计_首发			numeric(20,4)
	,基金专户股票型_销售金额_年累计_首发			numeric(20,4)
	,基金专户债券型_销售金额_年累计_首发			numeric(20,4)
	,基金专户货币型_销售金额_年累计_首发			numeric(20,4)	
	,公募_销售金额_年累计_首发					numeric(20,4)
	,核心公募_销售金额_年累计_首发				numeric(20,4)
	,集合理财_销售金额_年累计_首发				numeric(20,4)
	,基金专户_销售金额_年累计_首发				numeric(20,4)
	--赎回金额_年累计
	,核心公募股票型_赎回金额_年累计				numeric(20,4)
	,非核心公募股票型_赎回金额_年累计				numeric(20,4)
	,公募债券型有手续费_赎回金额_年累计			numeric(20,4)
	,公募债券型无手续费_赎回金额_年累计			numeric(20,4)
	,公募货币型_赎回金额_年累计					numeric(20,4)
	,集合理财股票型_赎回金额_年累计				numeric(20,4)
	,集合理财债券型_赎回金额_年累计				numeric(20,4)
	,集合理财货币型_赎回金额_年累计				numeric(20,4)
	,基金专户股票型_赎回金额_年累计				numeric(20,4)
	,基金专户债券型_赎回金额_年累计				numeric(20,4)
	,基金专户货币型_赎回金额_年累计				numeric(20,4)	
	,公募_赎回金额_年累计							numeric(20,4)
	,核心公募_赎回金额_年累计						numeric(20,4)
	,集合理财_赎回金额_年累计						numeric(20,4)
	,基金专户_赎回金额_年累计						numeric(20,4)	
	--期初市值
	,核心公募股票型_期初市值						numeric(20,4)
	,非核心公募股票型_期初市值					numeric(20,4)
	,公募债券型有手续费_期初市值					numeric(20,4)
	,公募债券型无手续费_期初市值					numeric(20,4)
	,公募货币型_期初市值							numeric(20,4)
	,集合理财股票型_期初市值						numeric(20,4)
	,集合理财债券型_期初市值						numeric(20,4)
	,集合理财货币型_期初市值						numeric(20,4)
	,基金专户股票型_期初市值						numeric(20,4)
	,基金专户债券型_期初市值						numeric(20,4)
	,基金专户货币型_期初市值						numeric(20,4)	
	,公募_期初市值								numeric(20,4)
	,核心公募_期初市值							numeric(20,4)
	,集合理财_期初市值							numeric(20,4)
	,基金专户_期初市值							numeric(20,4)
	--期末市值
	,核心公募股票型_期末市值						numeric(20,4)
	,非核心公募股票型_期末市值					numeric(20,4)
	,公募债券型有手续费_期末市值					numeric(20,4)
	,公募债券型无手续费_期末市值					numeric(20,4)
	,公募货币型_期末市值							numeric(20,4)
	,集合理财股票型_期末市值						numeric(20,4)
	,集合理财债券型_期末市值						numeric(20,4)
	,集合理财货币型_期末市值						numeric(20,4)
	,基金专户股票型_期末市值						numeric(20,4)
	,基金专户债券型_期末市值						numeric(20,4)
	,基金专户货币型_期末市值						numeric(20,4)	
	,公募_期末市值								numeric(20,4)
	,核心公募_期末市值							numeric(20,4)
	,集合理财_期末市值							numeric(20,4)
	,基金专户_期末市值							numeric(20,4)
	--月日均市值
	,核心公募股票型_月日均市值					numeric(20,4)
	,非核心公募股票型_月日均市值					numeric(20,4)
	,公募债券型有手续费_月日均市值				numeric(20,4)
	,公募债券型无手续费_月日均市值				numeric(20,4)
	,公募货币型_月日均市值						numeric(20,4)
	,集合理财股票型_月日均市值					numeric(20,4)
	,集合理财债券型_月日均市值					numeric(20,4)
	,集合理财货币型_月日均市值					numeric(20,4)
	,基金专户股票型_月日均市值					numeric(20,4)
	,基金专户债券型_月日均市值					numeric(20,4)
	,基金专户货币型_月日均市值					numeric(20,4)	
	,公募_月日均市值								numeric(20,4)
	,核心公募_月日均市值							numeric(20,4)
	,集合理财_月日均市值							numeric(20,4)
	,基金专户_月日均市值							numeric(20,4)
	--年日均市值		
	,核心公募股票型_年日均市值					numeric(20,4)
	,非核心公募股票型_年日均市值					numeric(20,4)
	,公募债券型有手续费_年日均市值				numeric(20,4)
	,公募债券型无手续费_年日均市值				numeric(20,4)
	,公募货币型_年日均市值						numeric(20,4)
	,集合理财股票型_年日均市值					numeric(20,4)
	,集合理财债券型_年日均市值					numeric(20,4)
	,集合理财货币型_年日均市值					numeric(20,4)
	,基金专户股票型_年日均市值					numeric(20,4)
	,基金专户债券型_年日均市值					numeric(20,4)
	,基金专户货币型_年日均市值					numeric(20,4)	
	,公募_年日均市值								numeric(20,4)
	,核心公募_年日均市值							numeric(20,4)
	,集合理财_年日均市值							numeric(20,4)
	,基金专户_年日均市值							numeric(20,4)
	--认申购手续费_月累计
	,核心公募股票型_认申购手续费_月累计			numeric(20,4)
	,非核心公募股票型_认申购手续费_月累计			numeric(20,4)
	,公募债券型有手续费_认申购手续费_月累计		numeric(20,4)
	,公募债券型无手续费_认申购手续费_月累计		numeric(20,4)
	,公募货币型_认申购手续费_月累计				numeric(20,4)
	,集合理财股票型_认申购手续费_月累计			numeric(20,4)
	,集合理财债券型_认申购手续费_月累计			numeric(20,4)
	,集合理财货币型_认申购手续费_月累计			numeric(20,4)
	,基金专户股票型_认申购手续费_月累计			numeric(20,4)
	,基金专户债券型_认申购手续费_月累计			numeric(20,4)
	,基金专户货币型_认申购手续费_月累计			numeric(20,4)	
	,公募_认申购手续费_月累计						numeric(20,4)
	,核心公募_认申购手续费_月累计					numeric(20,4)
	,集合理财_认申购手续费_月累计					numeric(20,4)
	,基金专户_认申购手续费_月累计					numeric(20,4)
	--认申购手续费_月累计_首发
	,核心公募股票型_认申购手续费_月累计_首发		numeric(20,4)
	,非核心公募股票型_认申购手续费_月累计_首发		numeric(20,4)
	,公募债券型有手续费_认申购手续费_月累计_首发	numeric(20,4)
	,公募债券型无手续费_认申购手续费_月累计_首发	numeric(20,4)
	,公募货币型_认申购手续费_月累计_首发			numeric(20,4)
	,集合理财股票型_认申购手续费_月累计_首发		numeric(20,4)
	,集合理财债券型_认申购手续费_月累计_首发		numeric(20,4)
	,集合理财货币型_认申购手续费_月累计_首发		numeric(20,4)
	,基金专户股票型_认申购手续费_月累计_首发		numeric(20,4)
	,基金专户债券型_认申购手续费_月累计_首发		numeric(20,4)
	,基金专户货币型_认申购手续费_月累计_首发		numeric(20,4)	
	,公募_认申购手续费_月累计_首发				numeric(20,4)
	,核心公募_认申购手续费_月累计_首发			numeric(20,4)
	,集合理财_认申购手续费_月累计_首发			numeric(20,4)
	,基金专户_认申购手续费_月累计_首发			numeric(20,4)
	--认申购手续费_年累计
	,核心公募股票型_认申购手续费_年累计			numeric(20,4)
	,非核心公募股票型_认申购手续费_年累计			numeric(20,4)
	,公募债券型有手续费_认申购手续费_年累计		numeric(20,4)
	,公募债券型无手续费_认申购手续费_年累计		numeric(20,4)
	,公募货币型_认申购手续费_年累计				numeric(20,4)
	,集合理财股票型_认申购手续费_年累计			numeric(20,4)
	,集合理财债券型_认申购手续费_年累计			numeric(20,4)
	,集合理财货币型_认申购手续费_年累计			numeric(20,4)
	,基金专户股票型_认申购手续费_年累计			numeric(20,4)
	,基金专户债券型_认申购手续费_年累计			numeric(20,4)
	,基金专户货币型_认申购手续费_年累计			numeric(20,4)	
	,公募_认申购手续费_年累计						numeric(20,4)
	,核心公募_认申购手续费_年累计					numeric(20,4)
	,集合理财_认申购手续费_年累计					numeric(20,4)
	,基金专户_认申购手续费_年累计					numeric(20,4)
	--认申购手续费_年累计_首发
	,核心公募股票型_认申购手续费_年累计_首发		numeric(20,4)
	,非核心公募股票型_认申购手续费_年累计_首发		numeric(20,4)
	,公募债券型有手续费_认申购手续费_年累计_首发	numeric(20,4)
	,公募债券型无手续费_认申购手续费_年累计_首发	numeric(20,4)
	,公募货币型_认申购手续费_年累计_首发			numeric(20,4)
	,集合理财股票型_认申购手续费_年累计_首发		numeric(20,4)
	,集合理财债券型_认申购手续费_年累计_首发		numeric(20,4)
	,集合理财货币型_认申购手续费_年累计_首发		numeric(20,4)
	,基金专户股票型_认申购手续费_年累计_首发		numeric(20,4)
	,基金专户债券型_认申购手续费_年累计_首发		numeric(20,4)
	,基金专户货币型_认申购手续费_年累计_首发		numeric(20,4)	
	,公募_认申购手续费_年累计_首发				numeric(20,4)
	,核心公募_认申购手续费_年累计_首发			numeric(20,4)
	,集合理财_认申购手续费_年累计_首发			numeric(20,4)
	,基金专户_认申购手续费_年累计_首发			numeric(20,4)	
	,constraint pk_skb_temp_khcp_ys primary key (nian,yue,zjzh)	
);

insert into #temp_khcp_ys
(
	nian
	,yue
	,zjzh		
	--销售金额_月累计	
	,核心公募股票型_销售金额_月累计				
	,非核心公募股票型_销售金额_月累计				
	,公募债券型有手续费_销售金额_月累计			
	,公募债券型无手续费_销售金额_月累计			
	,公募货币型_销售金额_月累计					
	,集合理财股票型_销售金额_月累计				
	,集合理财债券型_销售金额_月累计				
	,集合理财货币型_销售金额_月累计				
	,基金专户股票型_销售金额_月累计				
	,基金专户债券型_销售金额_月累计				
	,基金专户货币型_销售金额_月累计					
	,公募_销售金额_月累计							
	,核心公募_销售金额_月累计						
	,集合理财_销售金额_月累计						
	,基金专户_销售金额_月累计							
	--销售金额_月累计_首发
	,核心公募股票型_销售金额_月累计_首发			
	,非核心公募股票型_销售金额_月累计_首发			
	,公募债券型有手续费_销售金额_月累计_首发		
	,公募债券型无手续费_销售金额_月累计_首发		
	,公募货币型_销售金额_月累计_首发				
	,集合理财股票型_销售金额_月累计_首发			
	,集合理财债券型_销售金额_月累计_首发			
	,集合理财货币型_销售金额_月累计_首发			
	,基金专户股票型_销售金额_月累计_首发			
	,基金专户债券型_销售金额_月累计_首发			
	,基金专户货币型_销售金额_月累计_首发				
	,公募_销售金额_月累计_首发					
	,核心公募_销售金额_月累计_首发				
	,集合理财_销售金额_月累计_首发				
	,基金专户_销售金额_月累计_首发				
	--赎回金额_月累计	
	,核心公募股票型_赎回金额_月累计				
	,非核心公募股票型_赎回金额_月累计				
	,公募债券型有手续费_赎回金额_月累计			
	,公募债券型无手续费_赎回金额_月累计			
	,公募货币型_赎回金额_月累计					
	,集合理财股票型_赎回金额_月累计				
	,集合理财债券型_赎回金额_月累计				
	,集合理财货币型_赎回金额_月累计				
	,基金专户股票型_赎回金额_月累计				
	,基金专户债券型_赎回金额_月累计				
	,基金专户货币型_赎回金额_月累计					
	,公募_赎回金额_月累计							
	,核心公募_赎回金额_月累计						
	,集合理财_赎回金额_月累计						
	,基金专户_赎回金额_月累计						
	--销售金额_年累计	
	,核心公募股票型_销售金额_年累计				
	,非核心公募股票型_销售金额_年累计				
	,公募债券型有手续费_销售金额_年累计			
	,公募债券型无手续费_销售金额_年累计			
	,公募货币型_销售金额_年累计					
	,集合理财股票型_销售金额_年累计				
	,集合理财债券型_销售金额_年累计				
	,集合理财货币型_销售金额_年累计				
	,基金专户股票型_销售金额_年累计				
	,基金专户债券型_销售金额_年累计				
	,基金专户货币型_销售金额_年累计					
	,公募_销售金额_年累计							
	,核心公募_销售金额_年累计						
	,集合理财_销售金额_年累计						
	,基金专户_销售金额_年累计						
	--销售金额_年累计_首发
	,核心公募股票型_销售金额_年累计_首发			
	,非核心公募股票型_销售金额_年累计_首发			
	,公募债券型有手续费_销售金额_年累计_首发		
	,公募债券型无手续费_销售金额_年累计_首发		
	,公募货币型_销售金额_年累计_首发				
	,集合理财股票型_销售金额_年累计_首发			
	,集合理财债券型_销售金额_年累计_首发			
	,集合理财货币型_销售金额_年累计_首发			
	,基金专户股票型_销售金额_年累计_首发			
	,基金专户债券型_销售金额_年累计_首发			
	,基金专户货币型_销售金额_年累计_首发				
	,公募_销售金额_年累计_首发					
	,核心公募_销售金额_年累计_首发				
	,集合理财_销售金额_年累计_首发				
	,基金专户_销售金额_年累计_首发				
	--赎回金额_年累计
	,核心公募股票型_赎回金额_年累计				
	,非核心公募股票型_赎回金额_年累计				
	,公募债券型有手续费_赎回金额_年累计			
	,公募债券型无手续费_赎回金额_年累计			
	,公募货币型_赎回金额_年累计					
	,集合理财股票型_赎回金额_年累计				
	,集合理财债券型_赎回金额_年累计				
	,集合理财货币型_赎回金额_年累计				
	,基金专户股票型_赎回金额_年累计				
	,基金专户债券型_赎回金额_年累计				
	,基金专户货币型_赎回金额_年累计					
	,公募_赎回金额_年累计							
	,核心公募_赎回金额_年累计						
	,集合理财_赎回金额_年累计						
	,基金专户_赎回金额_年累计							
	--期初市值
	,核心公募股票型_期初市值						
	,非核心公募股票型_期初市值					
	,公募债券型有手续费_期初市值					
	,公募债券型无手续费_期初市值					
	,公募货币型_期初市值							
	,集合理财股票型_期初市值						
	,集合理财债券型_期初市值						
	,集合理财货币型_期初市值						
	,基金专户股票型_期初市值						
	,基金专户债券型_期初市值						
	,基金专户货币型_期初市值							
	,公募_期初市值								
	,核心公募_期初市值							
	,集合理财_期初市值							
	,基金专户_期初市值							
	--期末市值
	,核心公募股票型_期末市值						
	,非核心公募股票型_期末市值					
	,公募债券型有手续费_期末市值					
	,公募债券型无手续费_期末市值					
	,公募货币型_期末市值							
	,集合理财股票型_期末市值						
	,集合理财债券型_期末市值						
	,集合理财货币型_期末市值						
	,基金专户股票型_期末市值						
	,基金专户债券型_期末市值						
	,基金专户货币型_期末市值							
	,公募_期末市值								
	,核心公募_期末市值							
	,集合理财_期末市值							
	,基金专户_期末市值							
	--月日均市值
	,核心公募股票型_月日均市值					
	,非核心公募股票型_月日均市值					
	,公募债券型有手续费_月日均市值				
	,公募债券型无手续费_月日均市值				
	,公募货币型_月日均市值						
	,集合理财股票型_月日均市值					
	,集合理财债券型_月日均市值					
	,集合理财货币型_月日均市值					
	,基金专户股票型_月日均市值					
	,基金专户债券型_月日均市值					
	,基金专户货币型_月日均市值						
	,公募_月日均市值								
	,核心公募_月日均市值							
	,集合理财_月日均市值							
	,基金专户_月日均市值							
	--年日均市值		
	,核心公募股票型_年日均市值					
	,非核心公募股票型_年日均市值					
	,公募债券型有手续费_年日均市值				
	,公募债券型无手续费_年日均市值				
	,公募货币型_年日均市值						
	,集合理财股票型_年日均市值					
	,集合理财债券型_年日均市值					
	,集合理财货币型_年日均市值					
	,基金专户股票型_年日均市值					
	,基金专户债券型_年日均市值					
	,基金专户货币型_年日均市值						
	,公募_年日均市值								
	,核心公募_年日均市值							
	,集合理财_年日均市值							
	,基金专户_年日均市值							
	--认申购手续费_月累计
	,核心公募股票型_认申购手续费_月累计			
	,非核心公募股票型_认申购手续费_月累计			
	,公募债券型有手续费_认申购手续费_月累计		
	,公募债券型无手续费_认申购手续费_月累计		
	,公募货币型_认申购手续费_月累计				
	,集合理财股票型_认申购手续费_月累计			
	,集合理财债券型_认申购手续费_月累计			
	,集合理财货币型_认申购手续费_月累计			
	,基金专户股票型_认申购手续费_月累计			
	,基金专户债券型_认申购手续费_月累计			
	,基金专户货币型_认申购手续费_月累计				
	,公募_认申购手续费_月累计						
	,核心公募_认申购手续费_月累计					
	,集合理财_认申购手续费_月累计					
	,基金专户_认申购手续费_月累计					
	--认申购手续费_月累计_首发
	,核心公募股票型_认申购手续费_月累计_首发		
	,非核心公募股票型_认申购手续费_月累计_首发		
	,公募债券型有手续费_认申购手续费_月累计_首发	
	,公募债券型无手续费_认申购手续费_月累计_首发	
	,公募货币型_认申购手续费_月累计_首发			
	,集合理财股票型_认申购手续费_月累计_首发		
	,集合理财债券型_认申购手续费_月累计_首发		
	,集合理财货币型_认申购手续费_月累计_首发		
	,基金专户股票型_认申购手续费_月累计_首发		
	,基金专户债券型_认申购手续费_月累计_首发		
	,基金专户货币型_认申购手续费_月累计_首发			
	,公募_认申购手续费_月累计_首发				
	,核心公募_认申购手续费_月累计_首发			
	,集合理财_认申购手续费_月累计_首发			
	,基金专户_认申购手续费_月累计_首发			
	--认申购手续费_年累计
	,核心公募股票型_认申购手续费_年累计			
	,非核心公募股票型_认申购手续费_年累计			
	,公募债券型有手续费_认申购手续费_年累计		
	,公募债券型无手续费_认申购手续费_年累计		
	,公募货币型_认申购手续费_年累计				
	,集合理财股票型_认申购手续费_年累计			
	,集合理财债券型_认申购手续费_年累计			
	,集合理财货币型_认申购手续费_年累计			
	,基金专户股票型_认申购手续费_年累计			
	,基金专户债券型_认申购手续费_年累计			
	,基金专户货币型_认申购手续费_年累计				
	,公募_认申购手续费_年累计						
	,核心公募_认申购手续费_年累计					
	,集合理财_认申购手续费_年累计					
	,基金专户_认申购手续费_年累计					
	--认申购手续费_年累计_首发
	,核心公募股票型_认申购手续费_年累计_首发		
	,非核心公募股票型_认申购手续费_年累计_首发		
	,公募债券型有手续费_认申购手续费_年累计_首发	
	,公募债券型无手续费_认申购手续费_年累计_首发	
	,公募货币型_认申购手续费_年累计_首发			
	,集合理财股票型_认申购手续费_年累计_首发		
	,集合理财债券型_认申购手续费_年累计_首发		
	,集合理财货币型_认申购手续费_年累计_首发		
	,基金专户股票型_认申购手续费_年累计_首发		
	,基金专户债券型_认申购手续费_年累计_首发		
	,基金专户货币型_认申购手续费_年累计_首发			
	,公募_认申购手续费_年累计_首发				
	,核心公募_认申购手续费_年累计_首发			
	,集合理财_认申购手续费_年累计_首发			
	,基金专户_认申购手续费_年累计_首发			
)
(
	select
		t1.nian
		,t1.yue
		,t1.zjzh	
		,t1.产品类型
		,t1.责权关系类型
		,sum(t1.销售金额_月累计) as 销售金额_月累计
		,sum(t1.销售金额_月累计_考核) as 销售金额_月累计_考核
		,sum(t1.赎回金额_月累计) as 赎回金额_月累计
		,sum(t1.赎回金额_月累计_考核) as 赎回金额_月累计_考核
		,sum(t1.销售金额_年累计) as 销售金额_年累计
		,sum(t1.销售金额_年累计_考核) as 销售金额_年累计_考核
		,sum(t1.赎回金额_年累计) as 赎回金额_年累计
		,sum(t1.赎回金额_年累计_考核) as 赎回金额_年累计_考核
		,sum(t1.期初市值) as 期初市值
		,sum(t1.期初市值_考核) as 期初市值_考核
		,sum(t1.期末市值) as 期末市值
		,sum(t1.期末市值_考核) as 期末市值_考核
		,sum(t1.月日均市值) as 月日均市值
		,sum(t1.月日均市值_考核) as 月日均市值_考核
		,sum(t1.年日均市值) as 年日均市值
		,sum(t1.年日均市值_考核) as 年日均市值_考核
		,sum(t1.认申购手续费_月累计) as 认申购手续费_月累计
		,sum(t1.认申购手续费_年累计) as 认申购手续费_年累计
		,sum(t1.销售金额_月累计_总部) as 销售金额_月累计_总部
		,sum(t1.销售金额_月累计_总部_考核) as 销售金额_月累计_总部_考核
		,sum(t1.赎回金额_月累计_总部) as 赎回金额_月累计_总部
		,sum(t1.赎回金额_月累计_总部_考核) as 赎回金额_月累计_总部_考核
		,sum(t1.销售金额_年累计_总部) as 销售金额_年累计_总部
		,sum(t1.销售金额_年累计_总部_考核) as 销售金额_年累计_总部_考核
		,sum(t1.赎回金额_年累计_总部) as 赎回金额_年累计_总部
		,sum(t1.赎回金额_年累计_总部_考核) as 赎回金额_年累计_总部_考核
		,sum(t1.期初市值_总部) as 期初市值_总部
		,sum(t1.期初市值_总部_考核) as 期初市值_总部_考核
		,sum(t1.期末市值_总部) as 期末市值_总部
		,sum(t1.期末市值_总部_考核) as 期末市值_总部_考核
		,sum(t1.月日均市值_总部) as 月日均市值_总部
		,sum(t1.月日均市值_总部_考核) as 月日均市值_总部_考核
		,sum(t1.年日均市值_总部) as 年日均市值_总部
		,sum(t1.年日均市值_总部_考核) as 年日均市值_总部_考核
		,sum(t1.销售金额_月累计_扣减后) as 销售金额_月累计_扣减后
		,sum(t1.销售金额_月累计_扣减后_考核) as 销售金额_月累计_扣减后_考核
		,sum(t1.赎回金额_月累计_扣减后) as 赎回金额_月累计_扣减后
		,sum(t1.赎回金额_月累计_扣减后_考核) as 赎回金额_月累计_扣减后_考核
		,sum(t1.销售金额_年累计_扣减后) as 销售金额_年累计_扣减后
		,sum(t1.销售金额_年累计_扣减后_考核) as 销售金额_年累计_扣减后_考核
		,sum(t1.赎回金额_年累计_扣减后) as 赎回金额_年累计_扣减后
		,sum(t1.赎回金额_年累计_扣减后_考核) as 赎回金额_年累计_扣减后_考核
		,sum(t1.期初市值_扣减后) as 期初市值_扣减后
		,sum(t1.期初市值_扣减后_考核) as 期初市值_扣减后_考核
		,sum(t1.期末市值_扣减后) as 期末市值_扣减后
		,sum(t1.期末市值_扣减后_考核) as 期末市值_扣减后_考核
		,sum(t1.月日均市值_扣减后) as 月日均市值_扣减后
		,sum(t1.月日均市值_扣减后_考核) as 月日均市值_扣减后_考核
		,sum(t1.年日均市值_扣减后) as 年日均市值_扣减后
		,sum(t1.年日均市值_扣减后_考核) as 年日均市值_扣减后_考核
		,sum(t1.销售金额_月累计_首发) as 销售金额_月累计_首发
		,sum(t1.销售金额_月累计_首发_考核) as 销售金额_月累计_首发_考核
		,sum(t1.销售金额_年累计_首发) as 销售金额_年累计_首发
		,sum(t1.销售金额_年累计_首发_考核) as 销售金额_年累计_首发_考核
		,sum(t1.认申购手续费_月累计_首发) as 认申购手续费_月累计_首发
		,sum(t1.认申购手续费_年累计_首发) as 认申购手续费_年累计_首发
		,sum(t1.换购金额_月累计) as 换购金额_月累计
		,sum(t1.换购金额_年累计) as 换购金额_年累计
	from #temp_khjjflmx t1
	group by t1.nian,t1.yue,t1.zjzh,t1.产品类型,t1.责权关系类型	
)