declare @nian varchar(16),@yue varchar(16),@nian_gx varchar(16),@yue_gx varchar(16)
set @nian='2013'
set @yue='03'
set @nian_gx='2013'
set @yue_gx='03'

select
	@nian||@yue as 年月,
	t1.营业部,
	t1.营业部_简称,
	t1.中心营业部,
	t1.分公司,
	--1、二级佣金（不含回购）
	case when 二级佣金_本月_全部=0 then 0 else 二级佣金_本月_目标/二级佣金_本月_全部 end as 二级佣金_本月,
	case when 二级佣金_本年_全部=0 then 0 else 二级佣金_本年_目标/二级佣金_本年_全部 end as 二级佣金_本年,
	--2、保证金利差收入
	case when 利差收入_本月_全部=0 then 0 else 利差收入_本月_目标/利差收入_本月_全部 end as 利差收入_本月,
	case when 利差收入_本年_全部=0 then 0 else 利差收入_本年_目标/利差收入_本年_全部 end as 利差收入_本年,
	--3、权益类公募手续费
	case when 核心公募股票型手续费_月累计_全部=0 then 0 else 核心公募股票型手续费_月累计_目标/核心公募股票型手续费_月累计_全部 end as 核心公募股票型手续费_月累计,
	case when 核心公募股票型手续费_年累计_全部=0 then 0 else 核心公募股票型手续费_年累计_目标/核心公募股票型手续费_年累计_全部 end as 核心公募股票型手续费_年累计,
	--4、权益类公募销售分仓
	case when 核心公募股票型销售_月累计_全部=0 then 0 else 核心公募股票型销售_月累计_目标/核心公募股票型销售_月累计_全部 end as 核心公募股票型销售_月累计,
	case when 核心公募股票型销售_年累计_全部=0 then 0 else 核心公募股票型销售_年累计_目标/核心公募股票型销售_年累计_全部 end as 核心公募股票型销售_年累计,
	--5、权益类公募保有分仓
	case when 核心公募股票型保有_月日均_全部=0 then 0 else 核心公募股票型保有_月日均_目标/核心公募股票型保有_月日均_全部 end as 核心公募股票型保有_月日均,
	case when 核心公募股票型保有_年日均_全部=0 then 0 else 核心公募股票型保有_年日均_目标/核心公募股票型保有_年日均_全部 end as 核心公募股票型保有_年日均,
	--6、权益类手续费及一次性奖励
	case when 集合理财股票型销售_月累计_全部=0 then 0 else 集合理财股票型销售_月累计_目标/集合理财股票型销售_月累计_全部 end as 集合理财股票型销售_月累计,
	case when 集合理财股票型销售_年累计_全部=0 then 0 else 集合理财股票型销售_年累计_目标/集合理财股票型销售_年累计_全部 end as 集合理财股票型销售_年累计,
	--7、权益类资管集合分仓收入
	case when 集合理财股票型保有_月日均_全部=0 then 0 else 集合理财股票型保有_月日均_目标/集合理财股票型保有_月日均_全部 end as 集合理财股票型保有_月日均,
	case when 集合理财股票型保有_年日均_全部=0 then 0 else 集合理财股票型保有_年日均_目标/集合理财股票型保有_年日均_全部 end as 集合理财股票型保有_年日均,
	
	--8、资管定向收入 1
	--9、其他权益类收入（含PE）1
	
	--10、基金专户-优先级
	case when 基金专户债券型保有_月日均_全部=0 then 0 else 基金专户债券型保有_月日均_目标/基金专户债券型保有_月日均_全部 end as 基金专户债券型保有_月日均,
	case when 基金专户债券型保有_年日均_全部=0 then 0 else 基金专户债券型保有_年日均_目标/基金专户债券型保有_年日均_全部 end as 基金专户债券型保有_年日均,
	--11、公募-债券型手续费
	case when 公募债券型有手续费手续费_月累计_全部=0 then 0 else 公募债券型有手续费手续费_月累计_目标/公募债券型有手续费手续费_月累计_全部 end as 公募债券型有手续费手续费_月累计,
	case when 公募债券型有手续费手续费_年累计_全部=0 then 0 else 公募债券型有手续费手续费_年累计_目标/公募债券型有手续费手续费_年累计_全部 end as 公募债券型有手续费手续费_年累计,
	--12、手续费及一次性奖励
	case when 集合理财债券型销售_月累计_全部=0 then 0 else 集合理财债券型销售_月累计_目标/集合理财债券型销售_月累计_全部 end as 集合理财债券型销售_月累计,
	case when 集合理财债券型销售_年累计_全部=0 then 0 else 集合理财债券型销售_年累计_目标/集合理财债券型销售_年累计_全部 end as 集合理财债券型销售_年累计,
	--13、管理费及分仓
	case when 集合理财债券型保有_月日均_全部=0 then 0 else 集合理财债券型保有_月日均_目标/集合理财债券型保有_月日均_全部 end as 集合理财债券型保有_月日均,
	case when 集合理财债券型保有_年日均_全部=0 then 0 else 集合理财债券型保有_年日均_目标/集合理财债券型保有_年日均_全部 end as 集合理财债券型保有_年日均,
	
	--14、私募及其他固收类收入 1
	
	--15、报价回购
	case when 报价回购规模_月日均_全部=0 then 0 else 报价回购规模_月日均_目标/报价回购规模_月日均_全部 end as 报价回购规模_月日均,
	case when 报价回购规模_年日均_全部=0 then 0 else 报价回购规模_年日均_目标/报价回购规模_年日均_全部 end as 报价回购规模_年日均,
	--16、债券回购
	case when 回购净佣金_月累计_全部=0 then 0 else 回购净佣金_月累计_目标/回购净佣金_月累计_全部 end as 回购净佣金_月累计,
	case when 回购净佣金_年累计_全部=0 then 0 else 回购净佣金_年累计_目标/回购净佣金_年累计_全部 end as 回购净佣金_年累计,
	--17、资管现金宝 未处理 设置为0
	case when 集合理财货币型保有_月日均_全部=0 then 0 else 集合理财货币型保有_月日均_目标/集合理财货币型保有_月日均_全部 end as 集合理财货币型保有_月日均,
	case when 集合理财货币型保有_年日均_全部=0 then 0 else 集合理财货币型保有_年日均_目标/集合理财货币型保有_年日均_全部 end as 集合理财货币型保有_年日均,
	
	--18、公募-货币型
	case when 公募货币型保有_月日均_全部=0 then 0 else 公募货币型保有_月日均_目标/公募货币型保有_月日均_全部 end as 公募货币型保有_月日均,
	case when 公募货币型保有_年日均_全部=0 then 0 else 公募货币型保有_年日均_目标/公募货币型保有_年日均_全部 end as 公募货币型保有_年日均,
	
	
	--19、信用交易佣金
	case when 融资融券信用交易佣金_月累计_全部=0 then 0 else 融资融券信用交易佣金_月累计_目标/融资融券信用交易佣金_月累计_全部 end as 融资融券信用交易佣金_月累计,
	case when 融资融券信用交易佣金_年累计_全部=0 then 0 else 融资融券信用交易佣金_年累计_目标/融资融券信用交易佣金_年累计_全部 end as 融资融券信用交易佣金_年累计,
	
	--20、利息收入
	case when 融资融券利息收入_月累计_全部=0 then 0 else 融资融券利息收入_月累计_目标/融资融券利息收入_月累计_全部 end as 融资融券利息收入_月累计,
	case when 融资融券利息收入_年累计_全部=0 then 0 else 融资融券利息收入_年累计_目标/融资融券利息收入_年累计_全部 end as 融资融券利息收入_年累计,		
	
	--21、约定购回佣金收入
	case when 约定购回净佣金_月累计_全部=0 then 0 else 约定购回净佣金_月累计_目标/约定购回净佣金_月累计_全部 end as 约定购回净佣金_月累计,
	case when 约定购回净佣金_年累计_全部=0 then 0 else 约定购回净佣金_年累计_目标/约定购回净佣金_年累计_全部 end as 约定购回净佣金_年累计,
		
	--22、约定购回利息收入
	case when 约定购回实收利息_月累计_全部=0 then 0 else 约定购回实收利息_月累计_目标/约定购回实收利息_月累计_全部 end as 约定购回实收利息_月累计,
	case when 约定购回实收利息_年累计_全部=0 then 0 else 约定购回实收利息_年累计_目标/约定购回实收利息_年累计_全部 end as 约定购回实收利息_年累计,

	--23、私人线-创新收入 1
	--24、机构线-创新收入 1

	--25、内部创设产品收入
	case when 内部创收产品销售_月累计_全部=0 then 0 else 内部创收产品销售_月累计_目标/内部创收产品销售_月累计_全部 end as 内部创收产品销售_月累计,
	case when 内部创收产品销售_年累计_全部=0 then 0 else 内部创收产品销售_年累计_目标/内部创收产品销售_年累计_全部 end as 内部创收产品销售_年累计,	
	
	--明细数据
	sum(case when t1.是否营业部目标客户=1 and t1.是否年新增=1 and t1.是否100万以上=1 then t1.佣金收入_月累计 else 0 end)/10000 as 二级佣金_本月_目标,
	sum(t1.佣金收入_月累计)/10000 as 二级佣金_本月_全部,
--	case when 二级佣金_本月_全部=0 then 0 else 二级佣金_本月_目标/二级佣金_本月_全部 end as 二级佣金_本月,
	
	sum(case when t1.是否营业部目标客户=1 and t1.是否年新增=1 and t1.是否100万以上=1 then t1.佣金收入_年累计 else 0 end)/10000 as 二级佣金_本年_目标,
	sum(t1.佣金收入_年累计)/10000 as 二级佣金_本年_全部,
--	case when 二级佣金_本年_全部=0 then 0 else 二级佣金_本年_目标/二级佣金_本年_全部 end as 二级佣金_本年,
	
	sum(case when t1.是否营业部目标客户=1 and t1.是否年新增=1 and t1.是否100万以上=1 then t1.利差收入_月累计 else 0 end)/10000 as 利差收入_本月_目标,
	sum(t1.利差收入_月累计)/10000 as 利差收入_本月_全部,
--	case when 利差收入_本月_全部=0 then 0 else 利差收入_本月_目标/利差收入_本月_全部 end as 利差收入_本月,
	
	sum(case when t1.是否营业部目标客户=1 and t1.是否年新增=1 and t1.是否100万以上=1 then t1.利差收入_年累计 else 0 end)/10000 as 利差收入_本年_目标,
	sum(t1.利差收入_年累计)/10000 as 利差收入_本年_全部,
--	case when 利差收入_本年_全部=0 then 0 else 利差收入_本年_目标/利差收入_本年_全部 end as 利差收入_本年,
	
	sum(case when t1.是否营业部目标客户=1 and t1.是否年新增=1 and t1.是否100万以上=1 then t1.核心公募股票型手续费_月累计 else 0 end)/10000 as 核心公募股票型手续费_月累计_目标,
	sum(t1.核心公募股票型手续费_月累计)/10000 as 核心公募股票型手续费_月累计_全部,
--	case when 核心公募股票型手续费_月累计_全部=0 then 0 else 核心公募股票型手续费_月累计_目标/核心公募股票型手续费_月累计_全部 end as 核心公募股票型手续费_月累计,
	
	sum(case when t1.是否营业部目标客户=1 and t1.是否年新增=1 and t1.是否100万以上=1 then t1.核心公募股票型手续费_年累计 else 0 end)/10000 as 核心公募股票型手续费_年累计_目标,
	sum(t1.核心公募股票型手续费_年累计)/10000 as 核心公募股票型手续费_年累计_全部,
--	case when 核心公募股票型手续费_年累计_全部=0 then 0 else 核心公募股票型手续费_年累计_目标/核心公募股票型手续费_年累计_全部 end as 核心公募股票型手续费_年累计,
	
	sum(case when t1.是否营业部目标客户=1 and t1.是否年新增=1 and t1.是否100万以上=1 then t1.核心公募股票型销售_月累计 else 0 end)/10000 as 核心公募股票型销售_月累计_目标,
	sum(t1.核心公募股票型销售_月累计)/10000 as 核心公募股票型销售_月累计_全部,
--	case when 核心公募股票型销售_月累计_全部=0 then 0 else 核心公募股票型销售_月累计_目标/核心公募股票型销售_月累计_全部 end as 核心公募股票型销售_月累计,	
	
	sum(case when t1.是否营业部目标客户=1 and t1.是否年新增=1 and t1.是否100万以上=1 then t1.核心公募股票型销售_年累计 else 0 end)/10000 as 核心公募股票型销售_年累计_目标,
	sum(t1.核心公募股票型销售_年累计)/10000 as 核心公募股票型销售_年累计_全部,
--	case when 核心公募股票型销售_年累计_全部=0 then 0 else 核心公募股票型销售_年累计_目标/核心公募股票型销售_年累计_全部 end as 核心公募股票型销售_年累计,	
	
	sum(case when t1.是否营业部目标客户=1 and t1.是否年新增=1 and t1.是否100万以上=1 then t1.核心公募股票型保有_月日均 else 0 end)/10000 as 核心公募股票型保有_月日均_目标,
	sum(t1.核心公募股票型保有_月日均)/10000 as 核心公募股票型保有_月日均_全部,
--	case when 核心公募股票型保有_月日均_全部=0 then 0 else 核心公募股票型保有_月日均_目标/核心公募股票型保有_月日均_全部 end as 核心公募股票型保有_月日均,
		
	sum(case when t1.是否营业部目标客户=1 and t1.是否年新增=1 and t1.是否100万以上=1 then t1.核心公募股票型保有_年日均 else 0 end)/10000 as 核心公募股票型保有_年日均_目标,
	sum(t1.核心公募股票型保有_年日均)/10000 as 核心公募股票型保有_年日均_全部,
--	case when 核心公募股票型保有_年日均_全部=0 then 0 else 核心公募股票型保有_年日均_目标/核心公募股票型保有_年日均_全部 end as 核心公募股票型保有_年日均,	
	
	sum(case when t1.是否营业部目标客户=1 and t1.是否年新增=1 and t1.是否100万以上=1 then t1.集合理财股票型销售_月累计 else 0 end)/10000 as 集合理财股票型销售_月累计_目标,
	sum(t1.集合理财股票型销售_月累计)/10000 as 集合理财股票型销售_月累计_全部,
--	case when 集合理财股票型销售_月累计_全部=0 then 0 else 集合理财股票型销售_月累计_目标/集合理财股票型销售_月累计_全部 end as 集合理财股票型销售_月累计,
	
	sum(case when t1.是否营业部目标客户=1 and t1.是否年新增=1 and t1.是否100万以上=1 then t1.集合理财股票型销售_年累计 else 0 end)/10000 as 集合理财股票型销售_年累计_目标,
	sum(t1.集合理财股票型销售_年累计)/10000 as 集合理财股票型销售_年累计_全部,
--	case when 集合理财股票型销售_年累计_全部=0 then 0 else 集合理财股票型销售_年累计_目标/集合理财股票型销售_年累计_全部 end as 集合理财股票型销售_年累计,
	
	sum(case when t1.是否营业部目标客户=1 and t1.是否年新增=1 and t1.是否100万以上=1 then t1.集合理财股票型保有_月日均 else 0 end)/10000 as 集合理财股票型保有_月日均_目标,
	sum(t1.集合理财股票型保有_月日均)/10000 as 集合理财股票型保有_月日均_全部,
--	case when 集合理财股票型保有_月日均_全部=0 then 0 else 集合理财股票型保有_月日均_目标/集合理财股票型保有_月日均_全部 end as 集合理财股票型保有_月日均,
			
	sum(case when t1.是否营业部目标客户=1 and t1.是否年新增=1 and t1.是否100万以上=1 then t1.集合理财股票型保有_年日均 else 0 end)/10000 as 集合理财股票型保有_年日均_目标,
	sum(t1.集合理财股票型保有_年日均)/10000 as 集合理财股票型保有_年日均_全部,
--	case when 集合理财股票型保有_年日均_全部=0 then 0 else 集合理财股票型保有_年日均_目标/集合理财股票型保有_年日均_全部 end as 集合理财股票型保有_年日均,
	
	--8、9按100%
	
	sum(case when t1.是否营业部目标客户=1 and t1.是否年新增=1 and t1.是否100万以上=1 then t1.基金专户债券型保有_月日均 else 0 end)/10000 as 基金专户债券型保有_月日均_目标,
	sum(t1.基金专户债券型保有_月日均)/10000 as 基金专户债券型保有_月日均_全部,
--	case when 基金专户债券型保有_月日均_全部=0 then 0 else 基金专户债券型保有_月日均_目标/基金专户债券型保有_月日均_全部 end as 基金专户债券型保有_月日均,
	
	sum(case when t1.是否营业部目标客户=1 and t1.是否年新增=1 and t1.是否100万以上=1 then t1.基金专户债券型保有_年日均 else 0 end)/10000 as 基金专户债券型保有_年日均_目标,
	sum(t1.基金专户债券型保有_年日均)/10000 as 基金专户债券型保有_年日均_全部,
--	case when 基金专户债券型保有_年日均_全部=0 then 0 else 基金专户债券型保有_年日均_目标/基金专户债券型保有_年日均_全部 end as 基金专户债券型保有_年日均,
	
	sum(case when t1.是否营业部目标客户=1 and t1.是否年新增=1 and t1.是否100万以上=1 then t1.公募债券型有手续费手续费_月累计 else 0 end)/10000 as 公募债券型有手续费手续费_月累计_目标,
	sum(t1.公募债券型有手续费手续费_月累计)/10000 as 公募债券型有手续费手续费_月累计_全部,
--	case when 公募债券型有手续费手续费_月累计_全部=0 then 0 else 公募债券型有手续费手续费_月累计_目标/公募债券型有手续费手续费_月累计_全部 end as 公募债券型有手续费手续费_月累计,
	
	sum(case when t1.是否营业部目标客户=1 and t1.是否年新增=1 and t1.是否100万以上=1 then t1.公募债券型有手续费手续费_年累计 else 0 end)/10000 as 公募债券型有手续费手续费_年累计_目标,
	sum(t1.公募债券型有手续费手续费_年累计)/10000 as 公募债券型有手续费手续费_年累计_全部,
--	case when 公募债券型有手续费手续费_年累计_全部=0 then 0 else 公募债券型有手续费手续费_年累计_目标/公募债券型有手续费手续费_年累计_全部 end as 公募债券型有手续费手续费_年累计,
	
	sum(case when t1.是否营业部目标客户=1 and t1.是否年新增=1 and t1.是否100万以上=1 then t1.集合理财债券型销售_月累计 else 0 end)/10000 as 集合理财债券型销售_月累计_目标,	
	sum(t1.集合理财债券型销售_月累计)/10000 as 集合理财债券型销售_月累计_全部,
--	case when 集合理财债券型销售_月累计_全部=0 then 0 else 集合理财债券型销售_月累计_目标/集合理财债券型销售_月累计_全部 end as 集合理财债券型销售_月累计,	
	
	sum(case when t1.是否营业部目标客户=1 and t1.是否年新增=1 and t1.是否100万以上=1 then t1.集合理财债券型销售_年累计 else 0 end)/10000 as 集合理财债券型销售_年累计_目标,
	sum(t1.集合理财债券型销售_年累计)/10000 as 集合理财债券型销售_年累计_全部,
--	case when 集合理财债券型销售_年累计_全部=0 then 0 else 集合理财债券型销售_年累计_目标/集合理财债券型销售_年累计_全部 end as 集合理财债券型销售_年累计,
		
	sum(case when t1.是否营业部目标客户=1 and t1.是否年新增=1 and t1.是否100万以上=1 then t1.集合理财债券型保有_月日均 else 0 end)/10000 as 集合理财债券型保有_月日均_目标,
	sum(t1.集合理财债券型保有_月日均)/10000 as 集合理财债券型保有_月日均_全部,
--	case when 集合理财债券型保有_月日均_全部=0 then 0 else 集合理财债券型保有_月日均_目标/集合理财债券型保有_月日均_全部 end as 集合理财债券型保有_月日均,
	
	sum(case when t1.是否营业部目标客户=1 and t1.是否年新增=1 and t1.是否100万以上=1 then t1.集合理财债券型保有_年日均 else 0 end)/10000 as 集合理财债券型保有_年日均_目标,
	sum(t1.集合理财债券型保有_年日均)/10000 as 集合理财债券型保有_年日均_全部,
--	case when 集合理财债券型保有_年日均_全部=0 then 0 else 集合理财债券型保有_年日均_目标/集合理财债券型保有_年日均_全部 end as 集合理财债券型保有_年日均,		
	
	sum(case when t1.是否营业部目标客户=1 and t1.是否年新增=1 and t1.是否100万以上=1 then t1.报价回购规模_月日均 else 0 end)/10000 as 报价回购规模_月日均_目标,
	sum(t1.报价回购规模_月日均)/10000 as 报价回购规模_月日均_全部,
--	case when 报价回购规模_月日均_全部=0 then 0 else 报价回购规模_月日均_目标/报价回购规模_月日均_全部 end as 报价回购规模_月日均,
	
	sum(case when t1.是否营业部目标客户=1 and t1.是否年新增=1 and t1.是否100万以上=1 then t1.报价回购规模_年日均 else 0 end)/10000 as 报价回购规模_年日均_目标,
	sum(t1.报价回购规模_年日均)/10000 as 报价回购规模_年日均_全部,
--	case when 报价回购规模_年日均_全部=0 then 0 else 报价回购规模_年日均_目标/报价回购规模_年日均_全部 end as 报价回购规模_年日均,
	
	--债券回购
--	sum(case when t1.是否营业部目标客户=1 and t1.是否年新增=1 and t1.是否100万以上=1 then t1.回购净佣金_月累计 else 0 end)/sum(t1.回购净佣金_月累计)/10000 as 回购净佣金_月累计,
--	sum(case when t1.是否营业部目标客户=1 and t1.是否年新增=1 and t1.是否100万以上=1 then t1.回购净佣金_年累计 else 0 end)/sum(t1.回购净佣金_年累计)/10000 as 回购净佣金_年累计,
	
	sum(case when t1.是否营业部目标客户=1 and t1.是否年新增=1 and t1.是否100万以上=1 then t1.回购净佣金_月累计 else 0 end)/10000 as 回购净佣金_月累计_目标,
	sum(t1.回购净佣金_月累计)/10000 as 回购净佣金_月累计_全部,
--	case when 回购净佣金_月累计_全部=0 then 0 else 回购净佣金_月累计_目标/回购净佣金_月累计_全部 end as 回购净佣金_月累计,
	
	sum(case when t1.是否营业部目标客户=1 and t1.是否年新增=1 and t1.是否100万以上=1 then t1.回购净佣金_年累计 else 0 end)/10000 as 回购净佣金_年累计_目标,
	sum(t1.回购净佣金_年累计)/10000 as 回购净佣金_年累计_全部,
--	case when 回购净佣金_年累计_全部=0 then 0 else 回购净佣金_年累计_目标/回购净佣金_年累计_全部 end as 回购净佣金_年累计,
	
	--增加集合理财现金宝
	sum(case when t1.是否营业部目标客户=1 and t1.是否年新增=1 and t1.是否100万以上=1 then t1.集合理财货币型保有_月日均 else 0 end)/10000 as 集合理财货币型保有_月日均_目标,
	sum(t1.集合理财货币型保有_月日均)/10000 as 集合理财货币型保有_月日均_全部,
	
	sum(case when t1.是否营业部目标客户=1 and t1.是否年新增=1 and t1.是否100万以上=1 then t1.集合理财货币型保有_年日均 else 0 end)/10000 as 集合理财货币型保有_年日均_目标,
	sum(t1.集合理财货币型保有_年日均)/10000 as 集合理财货币型保有_年日均_全部,
	
--	sum(case when t1.是否营业部目标客户=1 and t1.是否年新增=1 and t1.是否100万以上=1 then t1.公募货币型保有_月日均 else 0 end)/sum(t1.公募货币型保有_月日均)/10000 as 公募货币型保有_月日均,
--	sum(case when t1.是否营业部目标客户=1 and t1.是否年新增=1 and t1.是否100万以上=1 then t1.公募货币型保有_年日均 else 0 end)/sum(t1.公募货币型保有_年日均)/10000 as 公募货币型保有_年日均,
	sum(case when t1.是否营业部目标客户=1 and t1.是否年新增=1 and t1.是否100万以上=1 then t1.公募货币型保有_月日均 else 0 end)/10000 as 公募货币型保有_月日均_目标,
	sum(t1.公募货币型保有_月日均)/10000 as 公募货币型保有_月日均_全部,
--	case when 公募货币型保有_月日均_全部=0 then 0 else 公募货币型保有_月日均_目标/公募货币型保有_月日均_全部 end as 公募货币型保有_月日均,
	
	sum(case when t1.是否营业部目标客户=1 and t1.是否年新增=1 and t1.是否100万以上=1 then t1.公募货币型保有_年日均 else 0 end)/10000 as 公募货币型保有_年日均_目标,
	sum(t1.公募货币型保有_年日均)/10000 as 公募货币型保有_年日均_全部,
--	case when 公募货币型保有_年日均_全部=0 then 0 else 公募货币型保有_年日均_目标/公募货币型保有_年日均_全部 end as 公募货币型保有_年日均,
	
	
	--19、信用交易佣金
	sum(case when t1.是否营业部目标客户=1 and t1.是否年新增=1 and t1.是否100万以上=1 then t1.融资融券信用交易佣金_月累计 else 0 end)/10000 as 融资融券信用交易佣金_月累计_目标,
	sum(t1.融资融券信用交易佣金_月累计)/10000 as 融资融券信用交易佣金_月累计_全部,
--	case when 融资融券信用交易佣金_月累计_全部=0 then 0 else 融资融券信用交易佣金_月累计_目标/融资融券信用交易佣金_月累计_全部 end as 融资融券信用交易佣金_月累计,
	
	sum(case when t1.是否营业部目标客户=1 and t1.是否年新增=1 and t1.是否100万以上=1 then t1.融资融券信用交易佣金_年累计 else 0 end)/10000 as 融资融券信用交易佣金_年累计_目标,
	sum(t1.融资融券信用交易佣金_年累计)/10000 as 融资融券信用交易佣金_年累计_全部,
--	case when 融资融券信用交易佣金_年累计_全部=0 then 0 else 融资融券信用交易佣金_年累计_目标/融资融券信用交易佣金_年累计_全部 end as 融资融券信用交易佣金_年累计,
	
	--20、利息收入
--	case when 融资融券利息收入_月累计_全部=0 then 0 else 融资融券利息收入_月累计_目标/融资融券利息收入_月累计_全部 end as 融资融券利息收入_月累计,
	sum(case when t1.是否营业部目标客户=1 and t1.是否年新增=1 and t1.是否100万以上=1 then t1.融资融券利息收入_月累计 else 0 end)/10000 as 融资融券利息收入_月累计_目标,
	sum(t1.融资融券利息收入_月累计)/10000 as 融资融券利息收入_月累计_全部,
	
--	case when 融资融券利息收入_年累计_全部=0 then 0 else 融资融券利息收入_年累计_目标/融资融券利息收入_年累计_全部 end as 融资融券利息收入_年累计,
	sum(case when t1.是否营业部目标客户=1 and t1.是否年新增=1 and t1.是否100万以上=1 then t1.融资融券利息收入_年累计 else 0 end)/10000 as 融资融券利息收入_年累计_目标,
	sum(t1.融资融券利息收入_年累计)/10000 as 融资融券利息收入_年累计_全部,
	
--	sum(case when t1.是否营业部目标客户=1 and t1.是否年新增=1 and t1.是否100万以上=1 then t1.约定购回净佣金_月累计 else 0 end)/sum(t1.约定购回净佣金_月累计)/10000 as 约定购回净佣金_月累计,
--	sum(case when t1.是否营业部目标客户=1 and t1.是否年新增=1 and t1.是否100万以上=1 then t1.约定购回净佣金_年累计 else 0 end)/sum(t1.约定购回净佣金_年累计)/10000 as 约定购回净佣金_年累计,
	sum(case when t1.是否营业部目标客户=1 and t1.是否年新增=1 and t1.是否100万以上=1 then t1.约定购回净佣金_月累计 else 0 end)/10000 as 约定购回净佣金_月累计_目标,
	sum(t1.约定购回净佣金_月累计)/10000 as 约定购回净佣金_月累计_全部,
--	case when 约定购回净佣金_月累计_全部=0 then 0 else 约定购回净佣金_月累计_目标/约定购回净佣金_月累计_全部 end as 约定购回净佣金_月累计,
	
	sum(case when t1.是否营业部目标客户=1 and t1.是否年新增=1 and t1.是否100万以上=1 then t1.约定购回净佣金_年累计 else 0 end)/10000 as 约定购回净佣金_年累计_目标,
	sum(t1.约定购回净佣金_年累计)/10000 as 约定购回净佣金_年累计_全部,
--	case when 约定购回净佣金_年累计_全部=0 then 0 else 约定购回净佣金_年累计_目标/约定购回净佣金_年累计_全部 end as 约定购回净佣金_年累计,
	
--	sum(case when t1.是否营业部目标客户=1 and t1.是否年新增=1 and t1.是否100万以上=1 then t1.约定购回实收利息_月累计 else 0 end)/sum(t1.约定购回实收利息_月累计)/10000 as 约定购回实收利息_月累计,
--	sum(case when t1.是否营业部目标客户=1 and t1.是否年新增=1 and t1.是否100万以上=1 then t1.约定购回实收利息_年累计 else 0 end)/sum(t1.约定购回实收利息_年累计)/10000 as 约定购回实收利息_年累计
	sum(case when t1.是否营业部目标客户=1 and t1.是否年新增=1 and t1.是否100万以上=1 then t1.约定购回实收利息_月累计 else 0 end)/10000 as 约定购回实收利息_月累计_目标,
	sum(t1.约定购回实收利息_月累计)/10000 as 约定购回实收利息_月累计_全部,
--	case when 约定购回实收利息_月累计_全部=0 then 0 else 约定购回实收利息_月累计_目标/约定购回实收利息_月累计_全部 end as 约定购回实收利息_月累计,
	
	sum(case when t1.是否营业部目标客户=1 and t1.是否年新增=1 and t1.是否100万以上=1 then t1.约定购回实收利息_年累计 else 0 end)/10000 as 约定购回实收利息_年累计_目标,
	sum(t1.约定购回实收利息_年累计)/10000 as 约定购回实收利息_年累计_全部
--	case when 约定购回实收利息_年累计_全部=0 then 0 else 约定购回实收利息_年累计_目标/约定购回实收利息_年累计_全部 end as 约定购回实收利息_年累计

	--内部创设产品销售
	,sum(case when t1.是否营业部目标客户=1 and t1.是否年新增=1 and t1.是否100万以上=1 then t1.内部创收产品销售_月累计 else 0 end)/10000 as 内部创收产品销售_月累计_目标
	,sum(t1.内部创收产品销售_月累计)/10000 as 内部创收产品销售_月累计_全部
	
	,sum(case when t1.是否营业部目标客户=1 and t1.是否年新增=1 and t1.是否100万以上=1 then t1.内部创收产品销售_年累计 else 0 end)/10000 as 内部创收产品销售_年累计_目标
	,sum(t1.内部创收产品销售_年累计)/10000 as 内部创收产品销售_年累计_全部
from  #temp_mbkhsrjg t1
where t1.营业部_简称 is not null
group by t1.营业部,t1.营业部_简称,t1.中心营业部,t1.分公司
order by t1.营业部,t1.营业部_简称,t1.中心营业部,t1.分公司
;

output to "C:\ado_data\月报数据\201303_91_目标客户收入结构_100万以上_年新增.xls" format excel
